--[[
▀▄ ▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀▄▀▄▄▀▀▄▄▀▀▄▄▀▀▄▄▀▀          
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄ ▄▀    BY OmarReal                       ▀▄ ▄▀ 
▀▄ ▄▀     BY OmarReal (Omar_Real)          ▀▄ ▄▀ 
▀▄ ▄▀ JUST WRITED BY OmarReal              ▀▄ ▄▀   
▀▄ ▄▀                                      ▀▄ ▄▀ 
▀▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀▄▄▀▀▄▄▀▄▄▀▀
--]]


do

function run(msg, matches)
  return [[ 
✅ - Group Promote  commands
➖🔸➖🔹➖🔸➖🔹➖
♣️ - /promote : رفع مشرف
♣️ - /demote : حذف مشرف 
♣️ - /spromote : اضافة #مدير
♣️ - /setadmin : لاضافة اداري
♣️ - /demote admin : تنزيل اداري
♣️ - /settings : اضهار الاعدادات
➖🔸➖🔹➖🔸➖🔹➖
✅Commands for control member
➖🔸➖🔹➖🔸➖🔹➖
♣️ - /kick : لطرد المستخدم
♣️ - /ban :  لحضر المستخدم
♣️ - /unban : لفك حضر المستخدم
♣️ - /kickme : للخروج من لمجموعه
♣️ - /silent  : لكتم المستخدم
♣️ - /silent  : لالغاء كتم المستخدم
♣️ - /mutelis : عرض المكتومين
♣️ - /sban : باند عام
♣️ - /unsban : لاغاء العام
➖🔸➖🔹➖🔸➖🔹➖
✅ - Group control  
➖🔸➖🔹➖🔸➖🔹➖
♣️ - /in : لعرض الايدي بلرد
♣️ - /info : لعرض معلومات المستخدم
♣️ - /id : لعرض ايدي المستخدم
♣️ - /res : لاضهار الاسم والايدي
♣️ - /rules : لاضهار القوانين
♣️ - /setrules : اضافه قوانين
♣️ - /about  : لاضهار الحول
♣️ - /setabout : اضافة حول 
♣️ - /setname : لاضافة اسم
♣️ - /setphoto : لاضافة صورة
♣️ - /link : لجلب الرابط خاص
♣️ - /getlink : لعرض الرابط
♣️ - /relink : تغير الرابط
♣️ - /settings : الاعدادات
♣️ - /tosuper : لتحويل المجموعة
♣️ - /newgroup : لصناعة مجموعة
♣️ - /add : لتفعيل المجموعة
♣️ - /rem : الغاء تفعيل المجموعة
♣️ - /text : لتحويل النص الى صورة
♣️ - me : لاضهار موقعك
♣️ - /getfile : لجلب ملف من السيرفر
♣ ️- /voice : لتحويل النص الى كلام
➖🔸➖🔹➖🔸➖🔹➖
✅ - Commands for group
➖🔸➖🔹➖🔸➖🔹➖
♣️ - /close|open links : منع الروابط والاعلانات
♣️ - /close|open photo : منع الصور
♣️ - /close|open sticker : منع ملصقات
♣️ - /close|open gifs : منع الصور المتحركة
♣️ - /close|open audio : منع بصمات
♣️ - /close|open video : منع فديوات
♣️ - /close|open text : لقفل النص
♣️ - /close|open contacts : لقفل مشاركة جهات الاتصال
♣️ - /close|open all : لقفل المحادثة
♣️ - /bot lock |unlock : لمنع البوتات
♣️ - /close|open spam : منع الكلايش الطويلة
♣️ - /close|open flood : قفل التكرار
♣️ - /setflood [5-20] تحديد عدد التكرار من
♣️ - /lock|unlock rtl : منع الاضافة الجماعية
♣️ - /close|open documents : لقفل الوسائط
♣️ - /setusername : وضع معرف للمجموعة
♣️ - /del : لحذف اي رسالة بل رد
♣️ - /block + الكلمة  : لحضر كلمة معينة
♣️ - /unblock + لاغاء حضر الكلمة
♣️ - /clean words : لحذف جميع الكلمات الممنوعة
♣️ - /clean modlist : لحذف الادمنية
♣️ - /clean about : لحذف الوصف
♣️ - /clean rules : لحذف القوانين
♣️ - /setusername : لاضافة معرف للمجموعة
♣️ - /clean username : لحذف معرف المجموعة
♣️ - /clean mutelist : لحذف المكتومين 
♣️ - /insta : + يوزر : يستعمل لجلب معلومات حساب الانستا مع الصورة
♣️ - /text : لتحويل النص الى صورة
➖🔸➖🔹➖🔸➖🔹➖
♣️ - /isup + رابط السيرفر
♣️ - /isup cron + رابط السيرفر
لجعل بوتك اقوى وتكون وقفاته قليلة

♠️ - Dev - @Omar_Real7


 ]]

end

return {
  description = "Shows bot help", 
  -- usage = /help: Shows bot help",
  patterns = {
    "^/help$"
  }, 
  run = run 
}

end
